# View Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpatialElementTag..::..View Property
SpatialElementTag Class See Also
---
The view in which the tag was placed.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public View View { get; }
```

Visual Basic
---
```text
Public ReadOnly Property View As View
	Get
```

Visual C++
---
```text
public:
property View^ View {
	View^ get ();
}
```

# See Also
SpatialElementTag Class
Autodesk.Revit.DB Namespace